# File Handling 
''' 
Файлтай харьцах нь аливаа веб програмын чухал хэсэг юм . Python нь файл үүсгэх , унших ,
шинэчлэх , устгах хэд хэдэн функцтэй . Python дахь файлуудтай ажиллах гол функц нь
open() функц юм . 
Open() функц нь 2 параметр авдаг . (Файлын нэр , горим)
'''

# There is 4 mode for opening file :
# 1. "r" -> (Stands for Read) (Үндсэн утга . Файлыг унших боломжгүй бол алдаа гардаг)
# 2. "a" -> (Stands for Add ) (Хавсралтад зориулж файлыг нээнэ, хэрэв байхгүй бол файлыг үүсгэдэг)
# 3. "w" -> (Stands for Write) (Бичих файлыг нээнэ, байхгүй бол файлыг үүсгэнэ)
# 4. "x" -> (Stands for eXecute) (Тодорхойлогдсон файлыг үүсгэдэг, хэрэв файл байгаа бол алдааг буцаадаг

# Мөн File-ийг 2-тийн болон текст горимоор ажилуулах эсэхийг шийдэж болдог

# "t" -> Text
# "b" -> Binary (Open picture with this option )


### SYNTAX ###

f = open("DemoText.txt")  # Үндсэн утга нь r .
f = open("DemoText.txt", "rt") # Бичвэр file уншихаар заасан